// utils/constants.ts
export const EARTHLY_BRANCHES = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];


export const LIFE_STAR_MAP: Record<string, string> = {
  甲: "廉貞",
  乙: "天機",
  丙: "天同",
  丁: "太陰",
  戊: "貪狼",
  己: "巨門",
  庚: "武曲",
  辛: "破軍",
  壬: "七殺",
  癸: "太陽",
};

export const BODY_STAR_MAP: Record<string, string> = {
  子: "貪狼",
  丑: "巨門",
  寅: "祿存",
  卯: "文曲",
  辰: "廉貞",
  巳: "武曲",
  午: "文昌",
  未: "天機",
  申: "天梁",
  酉: "天同",
  戌: "太陰",
  亥: "天相",
};

export const LUCKY_STAR_RULES: Record<string, string[]> = {
  // 天干對應：甲 => 文昌、乙 => 文曲...
  '甲': ['文昌', '左輔'],
  '乙': ['文曲', '右弼'],
  '丙': ['天魁'],
  '丁': ['天鉞'],
  '戊': ['文昌'],
  '己': ['文曲'],
  '庚': ['左輔'],
  '辛': ['右弼'],
  '壬': ['天魁'],
  '癸': ['天鉞']
};

export const EVIL_STAR_RULES: Record<string, string[]> = {
  // 地支對應：子 => 火星、丑 => 鈴星...
  '子': ['火星'],
  '丑': ['鈴星'],
  '寅': ['擎羊'],
  '卯': ['陀羅'],
  '辰': ['地空'],
  '巳': ['地劫'],
  '午': ['火星'],
  '未': ['鈴星'],
  '申': ['擎羊'],
  '酉': ['陀羅'],
  '戌': ['地空'],
  '亥': ['地劫']
};

export const TRANSFORM_STAR_RULES: Record<string, Record<'祿' | '權' | '科' | '忌', string>> = {
  甲: { '祿': '廉貞', '權': '破軍', '科': '武曲', '忌': '太陽' },
  乙: { '祿': '天機', '權': '天梁', '科': '紫微', '忌': '天同' },
  丙: { '祿': '天同', '權': '天機', '科': '文昌', '忌': '廉貞' },
  丁: { '祿': '太陰', '權': '天同', '科': '文曲', '忌': '巨門' },
  戊: { '祿': '貪狼', '權': '太陰', '科': '天梁', '忌': '天機' },
  己: { '祿': '武曲', '權': '貪狼', '科': '太陰', '忌': '文曲' },
  庚: { '祿': '太陽', '權': '武曲', '科': '文昌', '忌': '天梁' },
  辛: { '祿': '巨門', '權': '太陽', '科': '文曲', '忌': '天機' },
  壬: { '祿': '天梁', '權': '紫微', '科': '天機', '忌': '武曲' },
  癸: { '祿': '破軍', '權': '巨門', '科': '太陰', '忌': '貪狼' },
};